linux/wget.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>wget下载</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="wget下载"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-08 09:33:56 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">
<a href="#" id="tabzilla" class="tabzilla-opened" role="button" aria-expanded="true" aria-controls="tabzilla-panel" title="Close (Esc)">No_Joking</a>
</div>

<div id="content">
<h1 class="title">wget下载</h1>


<link rel="stylesheet" type="text/css" href="../css/bootstrap.mozilla.css" />
<link rel="stylesheet" type="text/css" href="../css/tabzilla.css" />
<link rel="stylesheet" type="text/css" href="../css/vf.css" />
<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<script src="../js/tabzilla.js"></script>
<script src="../bootstrap/js/bootstrap.js"></script>
<script src="../js/disqus-comment.js"></script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 OPTIONS</a>
<ul>
<li><a href="#sec-1-1">1.1 -r</a></li>
<li><a href="#sec-1-2">1.2 -l depth</a></li>
<li><a href="#sec-1-3">1.3 -k</a></li>
<li><a href="#sec-1-4">1.4 -O file</a></li>
<li><a href="#sec-1-5">1.5 -o logfile</a></li>
<li><a href="#sec-1-6">1.6 &ndash;limit-rate=amount</a></li>
<li><a href="#sec-1-7">1.7 -c</a></li>
<li><a href="#sec-1-8">1.8 -b</a></li>
<li><a href="#sec-1-9">1.9 &ndash;spider</a></li>
<li><a href="#sec-1-10">1.10 -t number</a></li>
<li><a href="#sec-1-11">1.11 -T seconds</a></li>
<li><a href="#sec-1-12">1.12 -q</a></li>
<li><a href="#sec-1-13">1.13 -v</a></li>
<li><a href="#sec-1-14">1.14 -i file</a></li>
<li><a href="#sec-1-15">1.15 -B URL</a></li>
<li><a href="#sec-1-16">1.16 -A acclist</a></li>
<li><a href="#sec-1-17">1.17 -R rejlist</a></li>
<li><a href="#sec-1-18">1.18 &ndash;user=user</a></li>
<li><a href="#sec-1-19">1.19 &ndash;password=password</a></li>
<li><a href="#sec-1-20">1.20 -p prefix</a></li>
<li><a href="#sec-1-21">1.21 -m</a></li>
</ul>
</li>
<li><a href="#sec-2">2 例子</a>
<ul>
<li><a href="#sec-2-1">2.1 下载网页</a></li>
<li><a href="#sec-2-2">2.2 下载网站</a></li>
<li><a href="#sec-2-3">2.3 下载文件并重命名</a></li>
<li><a href="#sec-2-4">2.4 下载所有匹配文件</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> OPTIONS</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> -r</h3>
<div class="outline-text-3" id="text-1-1">

<p>   &ndash;recursive<br/>
   对于HTTP主机，wget首先下载URL指定的文件，然后（如果该文件是一个HTML文档的话）递归下载该文件所引用（超级连接）的所有文件（递归深度由参数-l指定）<br/>
   对FTP主机，该参数意味着要下载URL指定的目录中的所有文件，递归方法与HTTP主机类似。<br/>
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> -l depth</h3>
<div class="outline-text-3" id="text-1-2">

<p>   &ndash;level=depth<br/>
   指定递归的最大深度<br/>
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> -k</h3>
<div class="outline-text-3" id="text-1-3">

<p>   &ndash;covert-links<br/>
   转化文档中的链接为本地链接<br/>
</p></div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> -O file</h3>
<div class="outline-text-3" id="text-1-4">

<p>   &ndash;output-document=file<br/>
   保存文件名<br/>
</p></div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> -o logfile</h3>
<div class="outline-text-3" id="text-1-5">

<p>   &ndash;output-file=logfile<br/>
   所有输出信息记录到logfile中<br/>
</p></div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> &ndash;limit-rate=amount</h3>
<div class="outline-text-3" id="text-1-6">

<p>   后跟限制下载速度<br/>
</p></div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> -c</h3>
<div class="outline-text-3" id="text-1-7">

<p>   &ndash;continue<br/>
   续传（下载一个大文件时突然发生中断，可以继续下载）<br/>
</p></div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> -b</h3>
<div class="outline-text-3" id="text-1-8">

<p>   &ndash;background<br/>
   后台下载，产生wget-log文件显示日志<br/>
</p></div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> &ndash;spider</h3>
<div class="outline-text-3" id="text-1-9">

<p>   后跟下载链接用来测试链接是否可用<br/>
</p></div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> -t number</h3>
<div class="outline-text-3" id="text-1-10">

<p>   &ndash;tries=number<br/>
   指定重试次数<br/>
</p></div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> -T seconds</h3>
<div class="outline-text-3" id="text-1-11">

<p>   &ndash;timeout=seconds<br/>
   超过seconds则停止<br/>
</p></div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> -q</h3>
<div class="outline-text-3" id="text-1-12">

<p>   &ndash;quiet<br/>
   关闭输出<br/>
</p></div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> -v</h3>
<div class="outline-text-3" id="text-1-13">

<p>   &ndash;verbose<br/>
   详细输出，默认<br/>
</p></div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> -i file</h3>
<div class="outline-text-3" id="text-1-14">

<p>   &ndash;input-file=file<br/>
   下载链接在file文件中<br/>
</p></div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> -B URL</h3>
<div class="outline-text-3" id="text-1-15">

<p>   -base=URL<br/>
   基址<br/>
</p></div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> -A acclist</h3>
<div class="outline-text-3" id="text-1-16">

<p>   &ndash;accept acclist<br/>
</p></div>

</div>

<div id="outline-container-1-17" class="outline-3">
<h3 id="sec-1-17"><span class="section-number-3">1.17</span> -R rejlist</h3>
<div class="outline-text-3" id="text-1-17">

<p>   &ndash;reject reglist<br/>
   使用逗号分隔的文件后缀或者通配符列表<br/>
</p></div>

</div>

<div id="outline-container-1-18" class="outline-3">
<h3 id="sec-1-18"><span class="section-number-3">1.18</span> &ndash;user=user</h3>
<div class="outline-text-3" id="text-1-18">

</div>

</div>

<div id="outline-container-1-19" class="outline-3">
<h3 id="sec-1-19"><span class="section-number-3">1.19</span> &ndash;password=password</h3>
<div class="outline-text-3" id="text-1-19">

<p>   用户名和密码，可以用于ftp和http，&ndash;ftp-user=user &ndash;ftp-password=password &ndash;http-user=user &ndash;http-passwor<br/>
</p></div>

</div>

<div id="outline-container-1-20" class="outline-3">
<h3 id="sec-1-20"><span class="section-number-3">1.20</span> -p prefix</h3>
<div class="outline-text-3" id="text-1-20">

<p>   &ndash;directory-prefix=prefix<br/>
   将下载文件保存在指定prefix中，默认是.即当前目录<br/>
</p></div>

</div>

<div id="outline-container-1-21" class="outline-3">
<h3 id="sec-1-21"><span class="section-number-3">1.21</span> -m</h3>
<div class="outline-text-3" id="text-1-21">

<p>   &ndash;mirror<br/>
   下载事件网站 wget -m fanhan.tk<br/>
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 例子</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 下载网页</h3>
<div class="outline-text-3" id="text-2-1">

<p>   wget fanhan.tk<br/>
   原封不动地下载该网站的index.html，但打开后发现由于路径问题链接的css路径 css/vf.css 不存在所以页面根本没法看，于是我们可以用-k选项将链接转换成适合在本地查看的形式，<br/>
   wget -k fanhan.tk<br/>
   此时可以看到 css/vf.css转变成了<a href="http://fanhan.tk/css/vf.css">http://fanhan.tk/css/vf.css</a> 于是打开index.html时浏览器会下载该文件以显示页面<br/>
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 下载网站</h3>
<div class="outline-text-3" id="text-2-2">

<p>   wget -m fanhan.tk<br/>
   把整个网站都下载下来<br/>
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 下载文件并重命名</h3>
<div class="outline-text-3" id="text-2-3">

<p>   wget -O emacs.tar.gz <a href="http://ftp.gnu.org/gnu/emacs/emacs-24.1.tar.gz">http://ftp.gnu.org/gnu/emacs/emacs-24.1.tar.gz</a><br/>
</p></div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 下载所有匹配文件</h3>
<div class="outline-text-3" id="text-2-4">

<p>   wget -r -A “*.tar.gz" <a href="http://ftp.gnu.org/gnu/emacs">http://ftp.gnu.org/gnu/emacs</a><br/>
   下载<a href="http://ftp.gnu.org/gnu/emacs">http://ftp.gnu.org/gnu/emacs</a> 目录下的所有以tar.gz结尾的文件<br/>
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-08 09:33:56 CST</p>
<p class="author">Author: visaya fan</p>
<p class="creator">Org version 7.8.11 with Emacs version 23</p>


</div>
</body>
</html>
